def validate_password(password):
    """
    Функция принимает пароль строкой и выполняет валидацию с помощью трёх
    вспомогательных функций:
    1. Содержит только a−z, A−Z, 0−9
    2. Содержит четное количество букв
    3. Содержит нечетное количество цифр
    Основная функция возвращает True, если пароль валидный.
    Если пароль не валидный, возвращает лист стрингов, в которых перечислены
    причины неуспешной проверки. Например: ["содержит запрещенные символы"]
    """
    pass


def int_converter(input_int):
    """
    Функция принимает число и конвертирует его в 4 форматах:
    decimal, octal, binary, hexadecimal. Каст в форматы описан в документации.
    При касте нужно избавляться от первых символов (0o31 -> 31, 0xe6 -> e6).
    Возвращает строку, отформатированную с помощью функции print_table.
    """
    pass


def print_table(cols=1, rows=1, *data):
    """
    Функция генерирует псевдотаблицу текстом.
    :cols: количество колонок в таблице
    :rows: количество строк в таблице
    :*data: лист листов, где каждый вложенный лист - строка данных.
    Пример: print_table(cols=4, rows=2, [["Decimal", "Octal", "Binary", "Hexadecimal"], [230, 346, 11100110, "e6"]])
    Вернет строку вида:
     -----------------------------------------------------------
    | Decimal      | Octal        | Binary       | Hexadecimal  |
    | 230          | 346          | 11100110     | e6           |
     -----------------------------------------------------------
    Форматирование должно полностью совпадать с примером.
    Обратить внимание на размеры ячеек - 12 символов на текст + по 1 вокруг
    слева и справа от разделителя |.
    """
    pass
